{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import base64\n",
    "import os\n",
    "from dotenv import load_dotenv\n",
    "import pandas as pd\n",
    "import langchain\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_community.llms import Ollama\n",
    "from langchain_community.chat_models import ChatOllama\n",
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "import ollama\n",
    "from langchain.chains import GraphCypherQAChain"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "import json\n",
    "\n",
    "def generate_response(prompt, model='llama3'):\n",
    "    url = \"http://localhost:11434/api/generate\"\n",
    "    data = {\n",
    "        \"model\": model,\n",
    "        \"prompt\": prompt,\n",
    "        \"stream\": False\n",
    "    }\n",
    "    response = requests.post(url, json=data)\n",
    "    return json.loads(response.text)['response']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"ML stands for Machine Learning. It's a subfield of Artificial Intelligence (AI) that involves training algorithms to learn from data, make predictions, and improve their performance over time without being explicitly programmed.\\n\\nMachine learning focuses on developing systems that can:\\n\\n1. **Learn**: Discover patterns, relationships, and insights from data.\\n2. **Predict**: Make informed decisions based on the learned knowledge.\\n3. **Improve**: Refine their performance through continuous learning from new data.\\n\\nThe primary goals of machine learning are:\\n\\n1. **Classification**: Predicting a category or class label (e.g., spam vs. non-spam emails).\\n2. **Regression**: Estimating continuous values or predictions (e.g., stock prices).\\n3. **Clustering**: Grouping similar data points into clusters.\\n4. **Dimensionality reduction**: Reducing the number of features in a dataset.\\n\\nMachine learning is applied in various fields, including:\\n\\n1. Computer Vision: Image recognition, object detection, and facial recognition.\\n2. Natural Language Processing (NLP): Sentiment analysis, language translation, and text summarization.\\n3. Speech Recognition: Transcribing spoken words into text.\\n4. Robotics: Control systems, motion planning, and autonomous decision-making.\\n5. Healthcare: Disease diagnosis, patient risk assessment, and personalized treatment recommendations.\\n6. Finance: Predicting stock prices, identifying market trends, and optimizing investment portfolios.\\n\\nSome popular machine learning algorithms include:\\n\\n1. Linear Regression\\n2. Decision Trees\\n3. Random Forests\\n4. Neural Networks (including Convolutional Neural Networks (CNNs) and Recurrent Neural Networks (RNNs))\\n5. Support Vector Machines (SVMs)\\n6. Gradient Boosting\\n\\nMachine learning has many applications, from self-driving cars to personalized recommendations on your phone or computer.\""
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "generate_response(\"what is ML?\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1. Load Data and select a Sample of records"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>plot</th>\n",
       "      <th>genres</th>\n",
       "      <th>runtime</th>\n",
       "      <th>cast</th>\n",
       "      <th>num_mflix_comments</th>\n",
       "      <th>poster</th>\n",
       "      <th>title</th>\n",
       "      <th>fullplot</th>\n",
       "      <th>languages</th>\n",
       "      <th>directors</th>\n",
       "      <th>writers</th>\n",
       "      <th>awards</th>\n",
       "      <th>imdb</th>\n",
       "      <th>countries</th>\n",
       "      <th>type</th>\n",
       "      <th>plot_embedding</th>\n",
       "      <th>rated</th>\n",
       "      <th>metacritic</th>\n",
       "      <th>awards_wins</th>\n",
       "      <th>imdb_rating</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Young Pauline is left a lot of money when her ...</td>\n",
       "      <td>[Action]</td>\n",
       "      <td>199.0</td>\n",
       "      <td>[Pearl White, Crane Wilbur, Paul Panzer, Edwar...</td>\n",
       "      <td>0</td>\n",
       "      <td>https://m.media-amazon.com/images/M/MV5BMzgxOD...</td>\n",
       "      <td>The Perils of Pauline</td>\n",
       "      <td>Young Pauline is left a lot of money when her ...</td>\n",
       "      <td>[English]</td>\n",
       "      <td>[Louis J. Gasnier, Donald MacKenzie]</td>\n",
       "      <td>[Charles W. Goddard (screenplay), Basil Dickey...</td>\n",
       "      <td>{'nominations': 0, 'text': '1 win.', 'wins': 1}</td>\n",
       "      <td>{'id': 4465, 'rating': 7.6, 'votes': 744}</td>\n",
       "      <td>[USA]</td>\n",
       "      <td>movie</td>\n",
       "      <td>[0.0007293965299999999, -0.026834568000000003,...</td>\n",
       "      <td>None</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1</td>\n",
       "      <td>7.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>A penniless young man tries to save an heiress...</td>\n",
       "      <td>[Comedy, Short, Action]</td>\n",
       "      <td>22.0</td>\n",
       "      <td>[Harold Lloyd, Mildred Davis, 'Snub' Pollard, ...</td>\n",
       "      <td>0</td>\n",
       "      <td>https://m.media-amazon.com/images/M/MV5BNzE1OW...</td>\n",
       "      <td>From Hand to Mouth</td>\n",
       "      <td>As a penniless man worries about how he will m...</td>\n",
       "      <td>[English]</td>\n",
       "      <td>[Alfred J. Goulding, Hal Roach]</td>\n",
       "      <td>[H.M. Walker (titles)]</td>\n",
       "      <td>{'nominations': 1, 'text': '1 nomination.', 'w...</td>\n",
       "      <td>{'id': 10146, 'rating': 7.0, 'votes': 639}</td>\n",
       "      <td>[USA]</td>\n",
       "      <td>movie</td>\n",
       "      <td>[-0.022837115, -0.022941574000000003, 0.014937...</td>\n",
       "      <td>TV-G</td>\n",
       "      <td>NaN</td>\n",
       "      <td>0</td>\n",
       "      <td>7.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                plot                   genres  \\\n",
       "0  Young Pauline is left a lot of money when her ...                 [Action]   \n",
       "1  A penniless young man tries to save an heiress...  [Comedy, Short, Action]   \n",
       "\n",
       "   runtime                                               cast  \\\n",
       "0    199.0  [Pearl White, Crane Wilbur, Paul Panzer, Edwar...   \n",
       "1     22.0  [Harold Lloyd, Mildred Davis, 'Snub' Pollard, ...   \n",
       "\n",
       "   num_mflix_comments                                             poster  \\\n",
       "0                   0  https://m.media-amazon.com/images/M/MV5BMzgxOD...   \n",
       "1                   0  https://m.media-amazon.com/images/M/MV5BNzE1OW...   \n",
       "\n",
       "                   title                                           fullplot  \\\n",
       "0  The Perils of Pauline  Young Pauline is left a lot of money when her ...   \n",
       "1     From Hand to Mouth  As a penniless man worries about how he will m...   \n",
       "\n",
       "   languages                             directors  \\\n",
       "0  [English]  [Louis J. Gasnier, Donald MacKenzie]   \n",
       "1  [English]       [Alfred J. Goulding, Hal Roach]   \n",
       "\n",
       "                                             writers  \\\n",
       "0  [Charles W. Goddard (screenplay), Basil Dickey...   \n",
       "1                             [H.M. Walker (titles)]   \n",
       "\n",
       "                                              awards  \\\n",
       "0    {'nominations': 0, 'text': '1 win.', 'wins': 1}   \n",
       "1  {'nominations': 1, 'text': '1 nomination.', 'w...   \n",
       "\n",
       "                                         imdb countries   type  \\\n",
       "0   {'id': 4465, 'rating': 7.6, 'votes': 744}     [USA]  movie   \n",
       "1  {'id': 10146, 'rating': 7.0, 'votes': 639}     [USA]  movie   \n",
       "\n",
       "                                      plot_embedding rated  metacritic  \\\n",
       "0  [0.0007293965299999999, -0.026834568000000003,...  None         NaN   \n",
       "1  [-0.022837115, -0.022941574000000003, 0.014937...  TV-G         NaN   \n",
       "\n",
       "   awards_wins  imdb_rating  \n",
       "0            1          7.6  \n",
       "1            0          7.0  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Load Dataset\n",
    "from datasets import load_dataset\n",
    "import pandas as pd\n",
    "\n",
    "# https://huggingface.co/datasets/AIatMongoDB/embedded_movies\n",
    "dataset = load_dataset(\"AIatMongoDB/embedded_movies\")\n",
    "\n",
    "# Convert the dataset to a pandas dataframe\n",
    "dataset_df = pd.DataFrame(dataset[\"train\"])\n",
    "dataset_df['awards_wins'] = dataset_df['awards'].apply(lambda x: x['wins'])\n",
    "dataset_df['imdb_rating'] = dataset_df['imdb'].apply(lambda x: x['rating'])\n",
    "dataset_df.head(2)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movie_id</th>\n",
       "      <th>title</th>\n",
       "      <th>languages</th>\n",
       "      <th>awards</th>\n",
       "      <th>imdb_rating</th>\n",
       "      <th>directors</th>\n",
       "      <th>cast</th>\n",
       "      <th>genres</th>\n",
       "      <th>tagline</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>The Perils of Pauline</td>\n",
       "      <td>English</td>\n",
       "      <td>1</td>\n",
       "      <td>7.6</td>\n",
       "      <td>Louis J. Gasnier | Donald MacKenzie</td>\n",
       "      <td>Pearl White | Crane Wilbur | Paul Panzer | Edw...</td>\n",
       "      <td>Action</td>\n",
       "      <td>The movie 'The Perils of Pauline' is a ('Actio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>From Hand to Mouth</td>\n",
       "      <td>English</td>\n",
       "      <td>0</td>\n",
       "      <td>7.0</td>\n",
       "      <td>Alfred J. Goulding | Hal Roach</td>\n",
       "      <td>Harold Lloyd | Mildred Davis | 'Snub' Pollard ...</td>\n",
       "      <td>Comedy | Short | Action</td>\n",
       "      <td>The movie 'From Hand to Mouth' is a ('Comedy',...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>Beau Geste</td>\n",
       "      <td>English</td>\n",
       "      <td>1</td>\n",
       "      <td>6.9</td>\n",
       "      <td>Herbert Brenon</td>\n",
       "      <td>Ronald Colman | Neil Hamilton | Ralph Forbes |...</td>\n",
       "      <td>Action | Adventure | Drama</td>\n",
       "      <td>The movie 'Beau Geste' is a ('Action', 'Advent...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>For Heavens Sake</td>\n",
       "      <td>English</td>\n",
       "      <td>0</td>\n",
       "      <td>7.6</td>\n",
       "      <td>Sam Taylor</td>\n",
       "      <td>Harold Lloyd | Jobyna Ralston | Noah Young | J...</td>\n",
       "      <td>Action | Comedy | Romance</td>\n",
       "      <td>The movie 'For Heavens Sake' is a ('Action', '...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>Men Without Women</td>\n",
       "      <td>English</td>\n",
       "      <td>1</td>\n",
       "      <td>5.8</td>\n",
       "      <td>John Ford</td>\n",
       "      <td>Kenneth MacKenna | Frank Albertson | J. Farrel...</td>\n",
       "      <td>Action | Drama</td>\n",
       "      <td>The movie 'Men Without Women' is a ('Action', ...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   movie_id                  title languages  awards  imdb_rating  \\\n",
       "0         1  The Perils of Pauline   English       1          7.6   \n",
       "1         2     From Hand to Mouth   English       0          7.0   \n",
       "2         3             Beau Geste   English       1          6.9   \n",
       "4         4       For Heavens Sake   English       0          7.6   \n",
       "5         5      Men Without Women   English       1          5.8   \n",
       "\n",
       "                             directors  \\\n",
       "0  Louis J. Gasnier | Donald MacKenzie   \n",
       "1       Alfred J. Goulding | Hal Roach   \n",
       "2                       Herbert Brenon   \n",
       "4                           Sam Taylor   \n",
       "5                            John Ford   \n",
       "\n",
       "                                                cast  \\\n",
       "0  Pearl White | Crane Wilbur | Paul Panzer | Edw...   \n",
       "1  Harold Lloyd | Mildred Davis | 'Snub' Pollard ...   \n",
       "2  Ronald Colman | Neil Hamilton | Ralph Forbes |...   \n",
       "4  Harold Lloyd | Jobyna Ralston | Noah Young | J...   \n",
       "5  Kenneth MacKenna | Frank Albertson | J. Farrel...   \n",
       "\n",
       "                       genres  \\\n",
       "0                      Action   \n",
       "1     Comedy | Short | Action   \n",
       "2  Action | Adventure | Drama   \n",
       "4   Action | Comedy | Romance   \n",
       "5              Action | Drama   \n",
       "\n",
       "                                             tagline  \n",
       "0  The movie 'The Perils of Pauline' is a ('Actio...  \n",
       "1  The movie 'From Hand to Mouth' is a ('Comedy',...  \n",
       "2  The movie 'Beau Geste' is a ('Action', 'Advent...  \n",
       "4  The movie 'For Heavens Sake' is a ('Action', '...  \n",
       "5  The movie 'Men Without Women' is a ('Action', ...  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import re\n",
    "\n",
    "def generate_movie_tagline(row):\n",
    "    tagline = f\"The movie '{row.title}' is a {row.genres} film directed by {row.directors}. Starring {row.cast}, with an IMDb rating of {row.imdb_rating}, the film has won {row.awards_wins} awards. It is available in {row.languages}. The movie's plot is: {row.fullplot}\"\n",
    "    return tagline\n",
    "\n",
    "def clean_string(text):\n",
    "    # Replace any non-alphanumeric character (excluding spaces) with an empty string\n",
    "    return re.sub(r'[^A-Za-z0-9\\s]', '', text)\n",
    "\n",
    "# dataset_df.columns\n",
    "drop_feats = ['plot', 'runtime', 'num_mflix_comments', 'poster', 'awards', 'imdb', 'type', 'metacritic', 'plot_embedding', 'rated', 'countries', 'writers']\n",
    "\n",
    "cleaned_df = dataset_df.drop(drop_feats, axis=1).dropna()\n",
    "\n",
    "# Apply the function to create a new column\n",
    "cleaned_df['title'] = cleaned_df['title'].apply(lambda x: clean_string(x))\n",
    "\n",
    "# Apply the function to create a new column\n",
    "cleaned_df['tagline'] = cleaned_df.apply(generate_movie_tagline, axis=1)\n",
    "\n",
    "for i in cleaned_df.columns:\n",
    "    cleaned_df[i] = cleaned_df[i].apply(lambda x: ' | '.join(x) if isinstance(x, list) else x)\n",
    "\n",
    "cleaned_df['movie_id'] = range(1, len(cleaned_df) + 1)\n",
    "\n",
    "organize_columns = ['movie_id', 'title', 'languages', 'awards_wins', 'imdb_rating', 'directors', 'cast', 'genres', 'tagline']\n",
    "\n",
    "cleaned_df = cleaned_df[organize_columns]\n",
    "\n",
    "cleaned_df.columns = ['movie_id', 'title', 'languages', 'awards', 'imdb_rating', 'directors', 'cast', 'genres', 'tagline']\n",
    "\n",
    "cleaned_df['tagline'] = cleaned_df['tagline'].str.replace('[', '(', regex=False).str.replace(']', ')', regex=False).str.replace('\"', \"'\", regex=False)\n",
    "\n",
    "\n",
    "cleaned_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The movie 'The Perils of Pauline' is a ('Action') film directed by ('Louis J. Gasnier', 'Donald MacKenzie'). Starring ('Pearl White', 'Crane Wilbur', 'Paul Panzer', 'Edward Josè'), with an IMDb rating of 7.6, the film has won 1 awards. It is available in ('English'). The movie's plot is: Young Pauline is left a lot of money when her wealthy uncle dies. However, her uncle's secretary has been named as her guardian until she marries, at which time she will officially take possession of her inheritance. Meanwhile, her 'guardian' and his confederates constantly come up with schemes to get rid of Pauline so that he can get his hands on the money himself.\n"
     ]
    }
   ],
   "source": [
    "print(cleaned_df.tagline[0])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "`Features - Properties`:\n",
    "* Movie - ID, Title, language,  imdb rating, Award, Plot / Description\n",
    "\n",
    "* Person - Director, Actor\n",
    "\n",
    "* Genre \n",
    "\n",
    "* Location"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2. Selecting a Sample of Records"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movie_id</th>\n",
       "      <th>title</th>\n",
       "      <th>languages</th>\n",
       "      <th>awards</th>\n",
       "      <th>imdb_rating</th>\n",
       "      <th>directors</th>\n",
       "      <th>cast</th>\n",
       "      <th>genres</th>\n",
       "      <th>tagline</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>221</th>\n",
       "      <td>211</td>\n",
       "      <td>Raiders of the Lost Ark</td>\n",
       "      <td>English | German | Hebrew | Spanish | Arabic |...</td>\n",
       "      <td>32</td>\n",
       "      <td>8.6</td>\n",
       "      <td>Steven Spielberg</td>\n",
       "      <td>Harrison Ford | Karen Allen | Paul Freeman | R...</td>\n",
       "      <td>Action | Adventure</td>\n",
       "      <td>The movie 'Raiders of the Lost Ark' is a ('Act...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>25</td>\n",
       "      <td>Road House</td>\n",
       "      <td>English</td>\n",
       "      <td>0</td>\n",
       "      <td>7.3</td>\n",
       "      <td>Jean Negulesco</td>\n",
       "      <td>Ida Lupino | Cornel Wilde | Celeste Holm | Ric...</td>\n",
       "      <td>Action | Drama | Film-Noir</td>\n",
       "      <td>The movie 'Road House' is a ('Action', 'Drama'...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1076</th>\n",
       "      <td>1036</td>\n",
       "      <td>The Recruit</td>\n",
       "      <td>English | Persian | Russian</td>\n",
       "      <td>0</td>\n",
       "      <td>6.6</td>\n",
       "      <td>Roger Donaldson</td>\n",
       "      <td>Al Pacino | Colin Farrell | Bridget Moynahan |...</td>\n",
       "      <td>Action | Crime | Drama</td>\n",
       "      <td>The movie 'The Recruit' is a ('Action', 'Crime...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>625</th>\n",
       "      <td>605</td>\n",
       "      <td>The Blade</td>\n",
       "      <td>Cantonese</td>\n",
       "      <td>1</td>\n",
       "      <td>7.2</td>\n",
       "      <td>Hark Tsui</td>\n",
       "      <td>Wenzhuo Zhao | Xin Xin Xiong | Sonny Song | Va...</td>\n",
       "      <td>Drama | Action</td>\n",
       "      <td>The movie 'The Blade' is a ('Drama', 'Action')...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1310</th>\n",
       "      <td>1258</td>\n",
       "      <td>72 Meters</td>\n",
       "      <td>Russian | Ukrainian</td>\n",
       "      <td>0</td>\n",
       "      <td>6.7</td>\n",
       "      <td>Vladimir Khotinenko</td>\n",
       "      <td>Sergey Makovetskiy | Marat Basharov | Andrey K...</td>\n",
       "      <td>Drama | Action | Thriller</td>\n",
       "      <td>The movie '72 Meters' is a ('Drama', 'Action',...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      movie_id                    title  \\\n",
       "221        211  Raiders of the Lost Ark   \n",
       "25          25               Road House   \n",
       "1076      1036              The Recruit   \n",
       "625        605                The Blade   \n",
       "1310      1258                72 Meters   \n",
       "\n",
       "                                              languages  awards  imdb_rating  \\\n",
       "221   English | German | Hebrew | Spanish | Arabic |...      32          8.6   \n",
       "25                                              English       0          7.3   \n",
       "1076                        English | Persian | Russian       0          6.6   \n",
       "625                                           Cantonese       1          7.2   \n",
       "1310                                Russian | Ukrainian       0          6.7   \n",
       "\n",
       "                directors                                               cast  \\\n",
       "221      Steven Spielberg  Harrison Ford | Karen Allen | Paul Freeman | R...   \n",
       "25         Jean Negulesco  Ida Lupino | Cornel Wilde | Celeste Holm | Ric...   \n",
       "1076      Roger Donaldson  Al Pacino | Colin Farrell | Bridget Moynahan |...   \n",
       "625             Hark Tsui  Wenzhuo Zhao | Xin Xin Xiong | Sonny Song | Va...   \n",
       "1310  Vladimir Khotinenko  Sergey Makovetskiy | Marat Basharov | Andrey K...   \n",
       "\n",
       "                          genres  \\\n",
       "221           Action | Adventure   \n",
       "25    Action | Drama | Film-Noir   \n",
       "1076      Action | Crime | Drama   \n",
       "625               Drama | Action   \n",
       "1310   Drama | Action | Thriller   \n",
       "\n",
       "                                                tagline  \n",
       "221   The movie 'Raiders of the Lost Ark' is a ('Act...  \n",
       "25    The movie 'Road House' is a ('Action', 'Drama'...  \n",
       "1076  The movie 'The Recruit' is a ('Action', 'Crime...  \n",
       "625   The movie 'The Blade' is a ('Drama', 'Action')...  \n",
       "1310  The movie '72 Meters' is a ('Drama', 'Action',...  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "n_records = 30\n",
    "df = cleaned_df.sample(n_records)\n",
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "# df.to_csv(f\"data/sampled_cleaned_movies_data_with_embeddings_{n_records}.csv\", index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 3. Initiate Neo4J and Load the data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Here is the Graph DB Schema:\n",
      "\n",
      "Node properties:\n",
      "Movie {title: STRING, awards: INTEGER, id: STRING, tagline: STRING, imdbRating: FLOAT}\n",
      "Person {name: STRING}\n",
      "Genre {name: STRING}\n",
      "Language {name: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Movie)-[:IN_GENRE]->(:Genre)\n",
      "(:Movie)-[:WAS_RELEASED_IN]->(:Language)\n",
      "(:Person)-[:DIRECTED]->(:Movie)\n",
      "(:Person)-[:ACTED_IN]->(:Movie)\n"
     ]
    }
   ],
   "source": [
    "from langchain.graphs import Neo4jGraph\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv()\n",
    "\n",
    "## Load the Neo4J graph db\n",
    "def load_neo4j_graph_db():\n",
    "    graph = Neo4jGraph(\n",
    "        url=os.getenv(\"NEO4J_URI\") ,\n",
    "        username=os.getenv(\"NEO4J_USERNAME\") ,\n",
    "        password=os.getenv(\"NEO4J_PASSWORD\") \n",
    "    )\n",
    "\n",
    "    graph.refresh_schema()\n",
    "    print(f\"Here is the Graph DB Schema:\\n\\n{graph.schema}\")\n",
    "\n",
    "    return graph\n",
    "\n",
    "graph_db = load_neo4j_graph_db()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Graph DB is not empty, so deleting the records from DB!\n",
      "\n",
      "Pushing new data to Graph DB\n",
      "\n",
      "Total Number of Records to push in Graph DB: 30\n",
      "\n",
      "Pushed all the records to the graph db!\n"
     ]
    }
   ],
   "source": [
    "## Load Data to Graph DB \n",
    "def load_data_to_graph_db(graph_db, df):\n",
    "    # Loop through each row in the DataFrame and add them to the Neo4j db\n",
    "    print(f\"\\nTotal Number of Records to push in Graph DB: {df.shape[0]}\")\n",
    "\n",
    "    for index, row in df.iterrows():\n",
    "\n",
    "        graph_db.query(f'''\n",
    "                MERGE (m:Movie {{title: '{row.title}'}})                             \n",
    "                SET m.awards = {row.awards},                        \n",
    "                    m.id = \"{row.movie_id}\",                                    \n",
    "                    m.tagline = \"{row.tagline}\",                                \n",
    "                    m.imdbRating = toFloat({(row.imdb_rating)}) \n",
    "                \n",
    "                FOREACH (director IN split(\"{row.directors}\", '|') |             \n",
    "                    MERGE (p:Person {{name: trim(director)}})                  \n",
    "                    MERGE (p)-[:DIRECTED]->(m))                             \n",
    "                            \n",
    "                FOREACH (actor IN split(\"{row.cast}\", '|') |                  \n",
    "                    MERGE (p:Person {{name: trim(actor)}})                     \n",
    "                    MERGE (p)-[:ACTED_IN]->(m))                             \n",
    "                            \n",
    "                FOREACH (genre IN split(\"{row.genres}\", '|') |                  \n",
    "                    MERGE (g:Genre {{name: trim(genre)}})                      \n",
    "                    MERGE (m)-[:IN_GENRE]->(g))                             \n",
    "                            \n",
    "                MERGE (l:Language {{name: trim(\"{row.languages}\")}})\n",
    "                MERGE (m)-[:WAS_RELEASED_IN]->(l)\n",
    "                        \n",
    "            ''')\n",
    "    \n",
    "    print(\"\\nPushed all the records to the graph db!\")\n",
    "\n",
    "def update_graph_db_with_new_data(graph_db, df):\n",
    "    graph_db.refresh_schema()\n",
    "    if graph_db.schema == 'Node properties:\\n\\nRelationship properties:\\n\\nThe relationships:\\n':\n",
    "        print(\"\\nGraph DB is Empty!\\n\")\n",
    "        load_data_to_graph_db(graph_db, df)\n",
    "    else:\n",
    "        print(\"\\nGraph DB is not empty, so deleting the records from DB!\")\n",
    "\n",
    "        ## Query to Delete all the nodes and relationship from the graph db\n",
    "        graph_db.query('''\n",
    "            MATCH (n)\n",
    "            DETACH DELETE n\n",
    "        ''')\n",
    "\n",
    "        print(\"\\nPushing new data to Graph DB\")\n",
    "        load_data_to_graph_db(graph_db, df)\n",
    "\n",
    "\n",
    "## Function to update the graph DB\n",
    "update_graph_db_with_new_data(graph_db, df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Movie {title: STRING, awards: INTEGER, id: STRING, tagline: STRING, imdbRating: FLOAT}\n",
      "Person {name: STRING}\n",
      "Genre {name: STRING}\n",
      "Language {name: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Movie)-[:IN_GENRE]->(:Genre)\n",
      "(:Movie)-[:WAS_RELEASED_IN]->(:Language)\n",
      "(:Person)-[:ACTED_IN]->(:Movie)\n",
      "(:Person)-[:DIRECTED]->(:Movie)\n"
     ]
    }
   ],
   "source": [
    "graph_db.refresh_schema()\n",
    "print(graph_db.schema)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Generate Embeddings - Tagline (Plot of the Movie)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "import ollama\n",
    "\n",
    "def embed_text(text:str):\n",
    "    response = ollama.embeddings(model=\"all-minilm\", prompt=text)\n",
    "    return response[\"embedding\"]   "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movie_id</th>\n",
       "      <th>title</th>\n",
       "      <th>languages</th>\n",
       "      <th>awards</th>\n",
       "      <th>imdb_rating</th>\n",
       "      <th>directors</th>\n",
       "      <th>cast</th>\n",
       "      <th>genres</th>\n",
       "      <th>tagline</th>\n",
       "      <th>tagline_embedding</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>221</th>\n",
       "      <td>211</td>\n",
       "      <td>Raiders of the Lost Ark</td>\n",
       "      <td>English | German | Hebrew | Spanish | Arabic |...</td>\n",
       "      <td>32</td>\n",
       "      <td>8.6</td>\n",
       "      <td>Steven Spielberg</td>\n",
       "      <td>Harrison Ford | Karen Allen | Paul Freeman | R...</td>\n",
       "      <td>Action | Adventure</td>\n",
       "      <td>The movie 'Raiders of the Lost Ark' is a ('Act...</td>\n",
       "      <td>[-0.04223256930708885, 0.12403502315282822, -0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>25</td>\n",
       "      <td>Road House</td>\n",
       "      <td>English</td>\n",
       "      <td>0</td>\n",
       "      <td>7.3</td>\n",
       "      <td>Jean Negulesco</td>\n",
       "      <td>Ida Lupino | Cornel Wilde | Celeste Holm | Ric...</td>\n",
       "      <td>Action | Drama | Film-Noir</td>\n",
       "      <td>The movie 'Road House' is a ('Action', 'Drama'...</td>\n",
       "      <td>[-0.04625450447201729, -0.10949589312076569, 0...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     movie_id                    title  \\\n",
       "221       211  Raiders of the Lost Ark   \n",
       "25         25               Road House   \n",
       "\n",
       "                                             languages  awards  imdb_rating  \\\n",
       "221  English | German | Hebrew | Spanish | Arabic |...      32          8.6   \n",
       "25                                             English       0          7.3   \n",
       "\n",
       "            directors                                               cast  \\\n",
       "221  Steven Spielberg  Harrison Ford | Karen Allen | Paul Freeman | R...   \n",
       "25     Jean Negulesco  Ida Lupino | Cornel Wilde | Celeste Holm | Ric...   \n",
       "\n",
       "                         genres  \\\n",
       "221          Action | Adventure   \n",
       "25   Action | Drama | Film-Noir   \n",
       "\n",
       "                                               tagline  \\\n",
       "221  The movie 'Raiders of the Lost Ark' is a ('Act...   \n",
       "25   The movie 'Road House' is a ('Action', 'Drama'...   \n",
       "\n",
       "                                     tagline_embedding  \n",
       "221  [-0.04223256930708885, 0.12403502315282822, -0...  \n",
       "25   [-0.04625450447201729, -0.10949589312076569, 0...  "
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df['tagline_embedding'] = df[\"tagline\"].apply(lambda x: embed_text(x))\n",
    "df.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of vectors: 30\n",
      "Embedding dimension: 384\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[-0.04223256930708885,\n",
       " 0.12403502315282822,\n",
       " -0.11337953060865402,\n",
       " 0.013988159596920013,\n",
       " 0.07863015681505203]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "print(\"Number of vectors:\", len(df['tagline_embedding']))\n",
    "print(\"Embedding dimension:\", len(df['tagline_embedding'].values[0]))\n",
    "df['tagline_embedding'].values[0][:5]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "* Create the Index on Embedding"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_vector_index_in_graph_db(graph_db, df):\n",
    "    graph_db.query(\"\"\"\n",
    "        CREATE VECTOR INDEX movie_tagline_embeddings IF NOT EXISTS      // Create a vector index named 'movie_tagline_embeddings' if it doesn't already exist  \n",
    "        FOR (m:Movie) ON (m.tagline_embedding)                           // Index the 'taglineEmbedding' property of Movie nodes \n",
    "        OPTIONS { indexConfig: {                                        // Set options for the index\n",
    "            `vector.dimensions`: 384,                                    // Specify the dimensionality of the vector space (1536 dimensions)\n",
    "            `vector.similarity_function`: 'cosine'                        // Specify the similarity function to be cosine similarity\n",
    "        }}\"\"\"\n",
    "    )\n",
    "\n",
    "    res = graph_db.query(\"\"\"\n",
    "        SHOW VECTOR INDEXES     // Retrieves information about all vector indexes in the database\n",
    "        \"\"\"\n",
    "        )\n",
    "    \n",
    "    print(f\"Sample Vector Index Response:\\n{res}\")\n",
    "\n",
    "    print(f\"Updating the graph db with tagline embeddings\") \n",
    "    for index, row in df.iterrows():\n",
    "        title = row['title']\n",
    "        embedding = row['tagline_embedding']\n",
    "        graph_db.query(f\"MATCH (m:Movie {{title: '{title}'}}) SET m.tagline_embedding = {embedding}\")\n",
    "\n",
    "    print(f\"Updated the graph db with tagline embeddings and here is the schema of the db:\\n{graph_db.schema}\") "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Sample Vector Index Response:\n",
      "[{'id': 2, 'name': 'movie_tagline_embeddings', 'state': 'ONLINE', 'populationPercent': 100.0, 'type': 'VECTOR', 'entityType': 'NODE', 'labelsOrTypes': ['Movie'], 'properties': ['tagline_embedding'], 'indexProvider': 'vector-2.0', 'owningConstraint': None, 'lastRead': None, 'readCount': 0}]\n",
      "Updating the graph db with tagline embeddings\n",
      "Updated the graph db with tagline embeddings and here is the schema of the db:\n",
      "Node properties:\n",
      "Movie {title: STRING, awards: INTEGER, id: STRING, tagline: STRING, imdbRating: FLOAT}\n",
      "Person {name: STRING}\n",
      "Genre {name: STRING}\n",
      "Language {name: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Movie)-[:IN_GENRE]->(:Genre)\n",
      "(:Movie)-[:WAS_RELEASED_IN]->(:Language)\n",
      "(:Person)-[:ACTED_IN]->(:Movie)\n",
      "(:Person)-[:DIRECTED]->(:Movie)\n"
     ]
    }
   ],
   "source": [
    "create_vector_index_in_graph_db(graph_db, df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The movie 'Kill Me Again' is a ('Action', 'Crime', 'Drama') film directed by ('John Dahl'). Starring ('Pat Mulligan', 'Nick Dimitri', 'Michael Madsen', 'Joanne Whalley'), with an IMDb rating of 6.3, the film has won 1 awards. It is available in ('English'). The movie's plot is: Fay Forrester, an attractive young lady wants to escape from her violent and jealous boyfriend Vince. So she hires Jack Andrews, a second class private investigator to arrange her death. She wants to restart her life with a new identity and the money she robbed together with Vince. Because of Jack's financial problems he joins Fay after her fake death. Unfortunately Vince finds out that Fay's still alive. The hunt for Jack, Fay and the money begins...\n"
     ]
    }
   ],
   "source": [
    "## Validation Query\n",
    "\n",
    "result = graph_db.query(\"\"\"\n",
    "    MATCH (m:Movie) \n",
    "    WHERE m.tagline IS NOT NULL\n",
    "    RETURN m.tagline, m.tagline_embedding\n",
    "    LIMIT 1\n",
    "    \"\"\"\n",
    ")\n",
    "\n",
    "print(result[0]['m.tagline'])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "* Graph DB is updated!"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2. Initiate LLM Models - Text to Cypher Model "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "## LLM Model names\n",
    "text_to_cypher_llm_model_name = \"tomasonjo/llama3-text2cypher-demo\"\n",
    "embedding_model_name = \"all-minilm\"\n",
    "\n",
    "## Initiate Cypher llm \n",
    "text_to_cypher_llm = ChatOllama(model=text_to_cypher_llm_model_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [],
   "source": [
    "# llm = Ollama(model=\"llama3\")\n",
    "# llm.invoke(\"what is ML?\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 3. Function & Templates"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "def simple_graph_db_search_by_generating_cypher_queries(graph_db, question):\n",
    "    # Template to convert Question to Cypher Query\n",
    "    prompt = ChatPromptTemplate.from_messages(\n",
    "        [\n",
    "            (\n",
    "                \"system\",\n",
    "                \"Given an input question, convert it to a Cypher query. No pre-amble.\",\n",
    "            ),\n",
    "            (\n",
    "                \"human\",\n",
    "                (\n",
    "                    \"Based on the Neo4j graph schema below, write a Cypher query that would answer the user's question: \"\n",
    "                    \"\\n{schema} \\nQuestion: {question} \\nCypher query:\"\n",
    "                ),\n",
    "            ),\n",
    "        ]\n",
    "    )\n",
    "\n",
    "    # Chain\n",
    "    cypher_query_chain = prompt | text_to_cypher_llm\n",
    "\n",
    "    # Generate Cypher Query using Chain\n",
    "    cypher_query_response = cypher_query_chain.invoke({\"question\": question, \"schema\": graph_db.schema}).content\n",
    "\n",
    "    # Trigger the Graph db to fetch results\n",
    "    result = graph_db.query(cypher_query_response)\n",
    "    print(f\"\\nGraph DB response:\\n{result}\")  \n",
    "\n",
    "    format_response = text_to_cypher_llm.invoke(f\"Based on the following content, format it in a more readable and understandable output to make clear to the audience, {result}\")\n",
    "    print(f\"\\nImproved responses:\\n{format_response.content}\")  \n",
    "    return format_response.content\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movie_id</th>\n",
       "      <th>title</th>\n",
       "      <th>languages</th>\n",
       "      <th>awards</th>\n",
       "      <th>imdb_rating</th>\n",
       "      <th>directors</th>\n",
       "      <th>cast</th>\n",
       "      <th>genres</th>\n",
       "      <th>tagline</th>\n",
       "      <th>tagline_embedding</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>221</th>\n",
       "      <td>211</td>\n",
       "      <td>Raiders of the Lost Ark</td>\n",
       "      <td>English | German | Hebrew | Spanish | Arabic |...</td>\n",
       "      <td>32</td>\n",
       "      <td>8.6</td>\n",
       "      <td>Steven Spielberg</td>\n",
       "      <td>Harrison Ford | Karen Allen | Paul Freeman | R...</td>\n",
       "      <td>Action | Adventure</td>\n",
       "      <td>The movie 'Raiders of the Lost Ark' is a ('Act...</td>\n",
       "      <td>[-0.04223256930708885, 0.12403502315282822, -0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>25</td>\n",
       "      <td>Road House</td>\n",
       "      <td>English</td>\n",
       "      <td>0</td>\n",
       "      <td>7.3</td>\n",
       "      <td>Jean Negulesco</td>\n",
       "      <td>Ida Lupino | Cornel Wilde | Celeste Holm | Ric...</td>\n",
       "      <td>Action | Drama | Film-Noir</td>\n",
       "      <td>The movie 'Road House' is a ('Action', 'Drama'...</td>\n",
       "      <td>[-0.04625450447201729, -0.10949589312076569, 0...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     movie_id                    title  \\\n",
       "221       211  Raiders of the Lost Ark   \n",
       "25         25               Road House   \n",
       "\n",
       "                                             languages  awards  imdb_rating  \\\n",
       "221  English | German | Hebrew | Spanish | Arabic |...      32          8.6   \n",
       "25                                             English       0          7.3   \n",
       "\n",
       "            directors                                               cast  \\\n",
       "221  Steven Spielberg  Harrison Ford | Karen Allen | Paul Freeman | R...   \n",
       "25     Jean Negulesco  Ida Lupino | Cornel Wilde | Celeste Holm | Ric...   \n",
       "\n",
       "                         genres  \\\n",
       "221          Action | Adventure   \n",
       "25   Action | Drama | Film-Noir   \n",
       "\n",
       "                                               tagline  \\\n",
       "221  The movie 'Raiders of the Lost Ark' is a ('Act...   \n",
       "25   The movie 'Road House' is a ('Action', 'Drama'...   \n",
       "\n",
       "                                     tagline_embedding  \n",
       "221  [-0.04223256930708885, 0.12403502315282822, -0...  \n",
       "25   [-0.04625450447201729, -0.10949589312076569, 0...  "
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.head(2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "* Search Graph DB - NLU to Cypher Queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "User Question: who was the cast of the movie Road House?\n",
      "\n",
      "\n",
      "Graph DB response:\n",
      "[{'actor': 'Ida Lupino', 'movie': 'Road House'}, {'actor': 'Cornel Wilde', 'movie': 'Road House'}, {'actor': 'Celeste Holm', 'movie': 'Road House'}, {'actor': 'Richard Widmark', 'movie': 'Road House'}]\n",
      "\n",
      "Improved responses:\n",
      "**Cast of \"Road House\"**\n",
      "\n",
      "* **Ida Lupino**: Starred in the movie \"Road House\"\n",
      "* **Cornel Wilde**: Starred in the movie \"Road House\"\n",
      "* **Celeste Holm**: Starred in the movie \"Road House\"\n",
      "* **Richard Widmark**: Starred in the movie \"Road House\"\n",
      "\n",
      "This format is easier to read and understand, making it clear that these actors have appeared in the same movie, \"Road House\".\n",
      "User Question: What are the most common genres for movies who got awards\n",
      "\n",
      "\n",
      "Graph DB response:\n",
      "[{'genre': 'Action', 'movie_count': 18}, {'genre': 'Adventure', 'movie_count': 10}, {'genre': 'Crime', 'movie_count': 6}, {'genre': 'Drama', 'movie_count': 6}, {'genre': 'Comedy', 'movie_count': 4}, {'genre': 'Sci-Fi', 'movie_count': 1}, {'genre': 'Romance', 'movie_count': 1}, {'genre': 'Musical', 'movie_count': 1}, {'genre': 'Biography', 'movie_count': 1}, {'genre': 'Horror', 'movie_count': 1}]\n",
      "\n",
      "Improved responses:\n",
      "Here is the formatted output:\n",
      "\n",
      "**Movie Genres and Count**\n",
      "\n",
      "| Genre | Movie Count |\n",
      "| --- | --- |\n",
      "| Action | 18 |\n",
      "| Adventure | 10 |\n",
      "| Crime | 6 |\n",
      "| Drama | 6 |\n",
      "| Comedy | 4 |\n",
      "| Sci-Fi | 1 |\n",
      "| Romance | 1 |\n",
      "| Musical | 1 |\n",
      "| Biography | 1 |\n",
      "| Horror | 1 |\n",
      "\n",
      "This format is more readable and understandable, making it clear to the audience that there are different movie genres with varying numbers of movies within each category.\n"
     ]
    }
   ],
   "source": [
    "q_toask = [\"who was the cast of the movie Road House?\", \"What are the most common genres for movies who got awards\"]\n",
    "\n",
    "for i in q_toask:\n",
    "    print(f\"User Question: {i}\\n\")\n",
    "    simple_graph_db_search_by_generating_cypher_queries(graph_db, i)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Method 2: GraphCypherQAChain"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "def cypher_chain_graph_db_search_by_generating_cypher_queries(graph_db, question):\n",
    "    graphCypher_chain = GraphCypherQAChain.from_llm(graph=graph_db, llm=text_to_cypher_llm, validate_cypher=True)\n",
    "\n",
    "    response = graphCypher_chain.invoke({\"query\": question})\n",
    "    print(f\"\\nGraph Cypher Chain response:\\n{response[\"result\"]}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "User Question: who was the cast of the movie Road House?\n",
      "\n",
      "Graph Cypher Chain response:\n",
      "Ida Lupino, Cornel Wilde, Celeste Holm, and Richard Widmark were part of the cast of the movie Road House.\n",
      "\n",
      "User Question: What are the most common genres for movies who got awards\n",
      "\n",
      "Graph Cypher Chain response:\n",
      "Action and Adventure are the most common genres for movies that have received awards.\n"
     ]
    }
   ],
   "source": [
    "for i in q_toask:\n",
    "    print(f\"\\nUser Question: {i}\")\n",
    "    cypher_chain_graph_db_search_by_generating_cypher_queries(graph_db, i)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Graph Cypher Chain response:\n",
      "Based on the action-packed and drama-filled plot of The Road House, I'd recommend the following movies:\n",
      "\n",
      "* First Blood (1982) - an iconic action movie with a strong focus on character development.\n",
      "* Point Break (1991) - an adrenaline-fueled thriller with a similar blend of high-stakes action and dramatic twists.\n",
      "* Speed Racer (2008) - a fast-paced, visually stunning film that explores the world of competitive racing.\n",
      "* The Driver (1978) - a gritty, intense movie that delves into the world of professional drivers.\n",
      "* Bullitt (1968) - an all-time classic with Steve McQueen's iconic car chases and intense drama.\n",
      "\n",
      "These movies share similar themes, action sequences, and dramatic plot twists that made The Road House an enjoyable watch.\n"
     ]
    }
   ],
   "source": [
    "q_three = \"Can you recommend some movies similar to The Road House\"\n",
    "\n",
    "cypher_chain_graph_db_search_by_generating_cypher_queries(graph_db, q_three)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Graph Cypher Chain response:\n",
      "Based on the provided information, I would recommend the following top genres movies with a high number of awards:\n",
      "\n",
      "* Adventure: 'Apocalypto' (AverageAwards: 5.454545454545454)\n",
      "* Drama: 'Proof of Life' (AverageAwards: 3.583333333333334)\n",
      "* Action: 'Eragon' (AverageAwards: 3.266666666666666)\n",
      "\n",
      "These movies have a significant number of awards, indicating their critical and commercial success.\n"
     ]
    }
   ],
   "source": [
    "q_four = \"Can you recommend some Top Genres Movies which has more Awards?\"\n",
    "\n",
    "cypher_chain_graph_db_search_by_generating_cypher_queries(graph_db, q_four)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Graph Cypher Chain response:\n",
      "30.\n"
     ]
    }
   ],
   "source": [
    "q_five = \"How many of the movies have the Action genre?\"\n",
    "cypher_chain_graph_db_search_by_generating_cypher_queries(graph_db, q_five)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Graph Cypher Chain response:\n",
      "Horror - 1, Family - 1, Action - 98, Adventure - 60, Drama - 43, Film-Noir - 0, Crime - 31, Thriller - 4, Musical - 3.\n"
     ]
    }
   ],
   "source": [
    "q_five = \"How many awards each genre have?\"\n",
    "cypher_chain_graph_db_search_by_generating_cypher_queries(graph_db, q_five)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Graph Cypher Chain response:\n",
      "Based on the action-packed and thrilling nature of Road House, here are three movie recommendations with at least one award:\n",
      "\n",
      "1. Point Break (1991) - This film has a similar blend of action, suspense, and drama, starring Patrick Swayze as an FBI agent chasing down a group of bank robbers. It received an MTV Movie Award nomination.\n",
      "2. Speed Racer (2008) - An adrenaline-fueled racing movie with impressive stunts and special effects, based on the classic anime series. It won several awards, including the Critics' Choice Movie Awards for Best Visual Effects and Best Young Performer.\n",
      "3. Bulletproof (1996) - A crime thriller starring Damon Wayans as a detective investigating the murder of his partner, leading to an intense cat-and-mouse chase with the killer. The movie received a Golden Globe nomination for Best Actor in a Motion Picture - Drama.\n",
      "\n",
      "These movies share similar themes and elements that made Road House exciting, and all have received critical acclaim or awards.\n"
     ]
    }
   ],
   "source": [
    "q_five = \"Recommend 3 movies similar to Road House and it should have atleast 1 award?\"\n",
    "cypher_chain_graph_db_search_by_generating_cypher_queries(graph_db, q_five)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Graph Cypher Chain response:\n",
      "Based on the provided list of movie data points, I recommend three action movies that meet your criteria:\n",
      "\n",
      "1. **The Matrix** (1999) - This iconic sci-fi action film won four Academy Awards, including Best Visual Effects, and has an English language soundtrack.\n",
      "2. **Mad Max: Fury Road** (2015) - This adrenaline-fueled action movie won six Academy Awards, including Best Picture and Best Costume Design, and features an all-English cast.\n",
      "3. **John Wick: Chapter 3 – Parabellum** (2019) - Although it didn't win any major awards, this action film has a strong following and is part of the highly acclaimed John Wick franchise.\n",
      "\n",
      "All three movies are English-language films with a significant focus on action sequences, making them excellent recommendations for fans of the genre.\n"
     ]
    }
   ],
   "source": [
    "q_five = \"Recommend 3 movies in Action genre which are in english language and it should have atleast 1 award?\"\n",
    "cypher_chain_graph_db_search_by_generating_cypher_queries(graph_db, q_five)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 4. Improve the Results \n",
    "##### 4.1 Embed the Question + Similarity Search on Tagline embedding + Generate Cypher Queries + Fetch"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Question -- Embed -- Similarity Search on Index -- Results accordingly"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "def embed_question_to_improve_search_results(graph, question):\n",
    "    question_emb = embed_text(question)\n",
    "\n",
    "    result = graph.query(\"\"\"\n",
    "            with $question_embedding as question_embedding      // Use the provided question embedding as 'question_embedding'\n",
    "            CALL db.index.vector.queryNodes(                    // Call the vector index query function\n",
    "                'movie_tagline_embeddings',                     // Name of the vector index to query against\n",
    "                $top_k,                                         // Number of top results to retrieve\n",
    "                question_embedding                              // The question embedding to compare against\n",
    "                ) YIELD node AS movie, score                    // Yield each matched node and its similarity score\n",
    "            RETURN movie.title, movie.tagline, score            // Return the title, tagline, and similarity score of each movie\n",
    "            \"\"\",\n",
    "            params={\n",
    "                \"question_embedding\": question_emb,       # Pass the question embedding as a parameter\n",
    "                \"top_k\": 3                                      # Specify the number of top results to retrieve\n",
    "    })\n",
    "\n",
    "    base_res = f\"\"\"Here is the graph db schema which has entities with properties and the relationship between entities\n",
    "            {graph.schema}\n",
    "            Here is the user question: {question}\n",
    "            Here is the model response: {result}\n",
    "\n",
    "            Based on the above information, summarize and format it in a better way to make it more understandable and readable to the user.\n",
    "            \"\"\"\n",
    "\n",
    "    improved_result = text_to_cypher_llm.invoke(base_res).content\n",
    "\n",
    "    print(improved_result)\n",
    "    return improved_result\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "**Top Genres with More Awarded Movies**\n",
      "\n",
      "Based on the movie database schema, here are the top genres with movies that have received more awards:\n",
      "\n",
      "**Note:** The ranking is based on the number of awards given to movies in each genre.\n",
      "\n",
      "1. **Drama**: 5 movies with a total of 17 awards\n",
      "\t* Examples: \"The Shawshank Redemption\" (7 awards), \"12 Years a Slave\" (6 awards)\n",
      "2. **Action**: 4 movies with a total of 13 awards\n",
      "\t* Examples: \"Mad Max: Fury Road\" (5 awards), \"The Matrix\" (3 awards)\n",
      "3. **Romance**: 3 movies with a total of 9 awards\n",
      "\t* Examples: \"Titanic\" (4 awards), \"The Proposal\" (2 awards)\n",
      "4. **Thriller**: 3 movies with a total of 7 awards\n",
      "\t* Examples: \"Seven\" (2 awards), \"Minority Report\" (1 award)\n",
      "5. **Science Fiction**: 2 movies with a total of 6 awards\n",
      "\t* Examples: \"Inception\" (3 awards), \"The Matrix Reloaded\" (1 award)\n",
      "\n",
      "**Limitations:** This recommendation only considers movies that have received awards and does not account for other factors like movie ratings or popularity.\n",
      "\n",
      "I hope this response is more understandable and readable!\n",
      "**Top Genres with More Awarded Movies**\n",
      "\n",
      "Based on the movie database schema, here are the top genres with movies that have received more awards:\n",
      "\n",
      "**Note:** The ranking is based on the number of awards given to movies in each genre.\n",
      "\n",
      "1. **Drama**: 5 movies with a total of 17 awards\n",
      "\t* Examples: \"The Shawshank Redemption\" (7 awards), \"12 Years a Slave\" (6 awards)\n",
      "2. **Action**: 4 movies with a total of 13 awards\n",
      "\t* Examples: \"Mad Max: Fury Road\" (5 awards), \"The Matrix\" (3 awards)\n",
      "3. **Romance**: 3 movies with a total of 9 awards\n",
      "\t* Examples: \"Titanic\" (4 awards), \"The Proposal\" (2 awards)\n",
      "4. **Thriller**: 3 movies with a total of 7 awards\n",
      "\t* Examples: \"Seven\" (2 awards), \"Minority Report\" (1 award)\n",
      "5. **Science Fiction**: 2 movies with a total of 6 awards\n",
      "\t* Examples: \"Inception\" (3 awards), \"The Matrix Reloaded\" (1 award)\n",
      "\n",
      "**Limitations:** This recommendation only considers movies that have received awards and does not account for other factors like movie ratings or popularity.\n",
      "\n",
      "I hope this response is more understandable and readable!\n"
     ]
    }
   ],
   "source": [
    "q_1 = \"Can you recommend some Top Genres Movies which has more Awards?\"\n",
    "\n",
    "res = embed_question_to_improve_search_results(graph_db, q_1)\n",
    "\n",
    "print(res)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### 4.2 Extracting Entities + Generate Cypher Queries + Trigger DB\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "metadata": {},
   "outputs": [],
   "source": [
    "def extract_entites_using_cypher_model(graph_db, question):\n",
    "    \n",
    "    ENTITY_EXTRACTION_AND_CYPHER_GENERATION_TEMPLATE = f\"\"\"\n",
    "                    Task: Breakdown the user input and Extract relevant entities from the user input and generate a Cypher query to retrieve the unknown entities using the known entities.\n",
    "                    Instructions:\n",
    "                    1. Identify and extract the known entities (e.g., movie title) from the user input.\n",
    "                    2. Determine the unknown entities (e.g., cast, awards, genres, directors) that need to be retrieved from the graph database.\n",
    "                    3. Use the known entities to generate a Cypher query that retrieves the values of the unknown entities and validate the generated Cypher query entities and relationships with the reference schema to ensure the query is valid.\n",
    "                    Schema:\n",
    "                    {graph_db.schema}\n",
    "                    Note: Do not include any explanations or apologies in your responses.\n",
    "                    Do not respond to any questions that might ask for anything other than extracting entities and generating a Cypher query.\n",
    "                    Do not include any text except the extracted entities and the generated Cypher query.\n",
    "                    Examples:\n",
    "\n",
    "                    # Example user input: \"Which genres does the movie Inception belong to and who directed it?\"\n",
    "                    Output:\n",
    "                    MATCH (m:Movie {{title: \"Inception\"}})\n",
    "                    OPTIONAL MATCH (m)-[:IN_GENRE]->(g:Genre)\n",
    "                    OPTIONAL MATCH (p:Person)-[:DIRECTED]->(m)\n",
    "                    RETURN collect(DISTINCT g.name) AS genres, collect(DISTINCT p.name) AS directors\n",
    "\n",
    "                    # Example user input: \"What is the IMDb rating of The Dark Knight, and in which language was it released?\"\n",
    "                    Output:\n",
    "                    MATCH (m:Movie {{title: \"The Dark Knight\"}})\n",
    "                    OPTIONAL MATCH (m)-[:WAS_RELEASED_IN]->(l:Language)\n",
    "                    RETURN m.imdbRating AS imdbRating, collect(DISTINCT l.name) AS languages\n",
    "\n",
    "                    # Example user input: \"Who acted in the movie Titanic, and what is its tagline?\"\n",
    "                    Output:\n",
    "                    MATCH (m:Movie {{title: \"Titanic\"}})\n",
    "                    OPTIONAL MATCH (p:Person)-[:ACTED_IN]->(m)\n",
    "                    RETURN collect(DISTINCT p.name) AS cast, m.tagline AS tagline\n",
    "\n",
    "                    # Example user input: \"Did the movie Avatar win any awards, and what is its IMDb rating?\"\n",
    "                    Output:\n",
    "                    MATCH (m:Movie {{title: \"Avatar\"}})\n",
    "                    RETURN m.awards AS awards, m.imdbRating AS imdbRating\n",
    "\n",
    "\n",
    "                    # Example user input: \"Which languages was the movie Parasite released in and who directed it?\"\n",
    "                    Output:\n",
    "                    MATCH (m:Movie {{title: \"Parasite\"}})\n",
    "                    OPTIONAL MATCH (m)-[:WAS_RELEASED_IN]->(l:Language)\n",
    "                    OPTIONAL MATCH (p:Person)-[:DIRECTED]->(m)\n",
    "                    RETURN collect(DISTINCT l.name) AS languages, collect(DISTINCT p.name) AS directors\n",
    "\n",
    "                    # Example user input: \"Recommend 3 movies with  atleast a award and should be in english language\"\n",
    "                    Output:\n",
    "                    MATCH (m:Movie)-[:WAS_RELEASED_IN]->(l:Language)\n",
    "                    WHERE l.name = 'English' AND m.awards > 1 \n",
    "                    RETURN m.title\n",
    "                    LIMIT 3\n",
    "\n",
    "                    # Example user input: \"Recommend 3 movies with imdb rating atleast 7 and atleast a award and should be in english language\"\n",
    "                    MATCH (m:Movie)-[:WAS_RELEASED_IN]->(l:Language)\n",
    "                    WHERE l.name = 'English' AND m.awards > 1 and m.imdbRating >= 7.0\n",
    "                    RETURN m.title\n",
    "                    LIMIT 3\n",
    "\n",
    "                    The question is:\n",
    "                    {question}\n",
    "        \"\"\"\n",
    "\n",
    "\n",
    "    entities_extracted_query = text_to_cypher_llm.invoke(ENTITY_EXTRACTION_AND_CYPHER_GENERATION_TEMPLATE).content\n",
    "    print(f\"\\nModel Generated Cypher Query:\\n\\n{entities_extracted_query}\")\n",
    "    fetched_results = graph_db.query(f\"\"\"{entities_extracted_query}\"\"\")\n",
    "    print(f\"\\n\\nFetched Results:\\n{fetched_results}\")\n",
    "\n",
    "    format_response = text_to_cypher_llm.invoke(f\"\"\"\n",
    "                    Given the user question:\\n{question} and the output response:\\n{fetched_results}, \n",
    "                    format the response in a more readable and understandable way for clarity, without adding any additional information.\n",
    "                    Note:\n",
    "                    Do not include any text except the provided information.\n",
    "                    \"\"\")\n",
    "\n",
    "    # format_response = text_to_cypher_llm.invoke(f\"Based on the following user question: \\n{question} and output response: \\n{fetched_results}, format it in a more readable and understandable output to make clear to the audience\")\n",
    "    print(f\"\\nImproved responses:\\n{format_response.content}\")  \n",
    "    return entities_extracted_query\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Question: 'who was the cast of the movie Road House and does the movie got any awards?'\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Failed to write data to connection ResolvedIPv4Address(('34.66.78.163', 7687)) (ResolvedIPv4Address(('34.66.78.163', 7687)))\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Model Generated Cypher Query:\n",
      "\n",
      "MATCH (m:Movie {title: \"Road House\"})\n",
      "OPTIONAL MATCH (p:Person)-[:ACTED_IN]->(m)\n",
      "RETURN collect(DISTINCT p.name) AS cast, m.awards AS awards\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Failed to write data to connection IPv4Address(('ad5eb799.databases.neo4j.io', 7687)) (ResolvedIPv4Address(('34.66.78.163', 7687)))\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "Fetched Results:\n",
      "[{'cast': ['Ida Lupino', 'Cornel Wilde', 'Celeste Holm', 'Richard Widmark'], 'awards': 0}]\n",
      "\n",
      "Improved responses:\n",
      "The cast of the movie Road House includes:\n",
      "\n",
      "• Ida Lupino\n",
      "• Cornel Wilde\n",
      "• Celeste Holm\n",
      "• Richard Widmark\n",
      "\n",
      "As for awards, the movie received none.\n",
      "\n",
      "Question: 'Can you recommend some Top Genres Movies which has more Awards'\n",
      "\n",
      "Model Generated Cypher Query:\n",
      "\n",
      "MATCH (m:Movie)\n",
      "WHERE m.awards > 0\n",
      "WITH m\n",
      "ORDER BY m.imdbRating DESC, m.awards DESC\n",
      "LIMIT 10\n",
      "RETURN m.title AS title, m.genres AS genres, m.awards AS awards, m.imdbRating AS imdbRating\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: genres)} {position: line: 6, column: 28, offset: 120} for query: 'MATCH (m:Movie)\\nWHERE m.awards > 0\\nWITH m\\nORDER BY m.imdbRating DESC, m.awards DESC\\nLIMIT 10\\nRETURN m.title AS title, m.genres AS genres, m.awards AS awards, m.imdbRating AS imdbRating'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "Fetched Results:\n",
      "[{'title': 'Raiders of the Lost Ark', 'genres': None, 'awards': 32, 'imdbRating': 8.6}, {'title': 'The French Connection', 'genres': None, 'awards': 24, 'imdbRating': 7.8}, {'title': 'Apocalypto', 'genres': None, 'awards': 12, 'imdbRating': 7.8}, {'title': 'The Blade', 'genres': None, 'awards': 1, 'imdbRating': 7.2}, {'title': 'Thunderball', 'genres': None, 'awards': 4, 'imdbRating': 7.0}, {'title': 'Pardes', 'genres': None, 'awards': 3, 'imdbRating': 7.0}, {'title': 'Alive', 'genres': None, 'awards': 2, 'imdbRating': 7.0}, {'title': 'Kopps', 'genres': None, 'awards': 5, 'imdbRating': 6.8}, {'title': 'All the Way Boys', 'genres': None, 'awards': 2, 'imdbRating': 6.7}, {'title': 'Kill Me Again', 'genres': None, 'awards': 1, 'imdbRating': 6.3}]\n",
      "\n",
      "Improved responses:\n",
      "Here are the top genres movies with more awards:\n",
      "1. Raiders of the Lost Ark (32 Awards)\n",
      "2. The French Connection (24 Awards)\n",
      "3. Apocalypto (12 Awards)\n",
      "4. Thunderball (4 Awards)\n",
      "5. Pardes (3 Awards)\n",
      "6. Alive (2 Awards)\n",
      "7. Kopps (5 Awards)\n",
      "8. All the Way Boys (2 Awards)\n",
      "9. Kill Me Again (1 Award)\n"
     ]
    }
   ],
   "source": [
    "example_queries = [\n",
    "    \"who was the cast of the movie Road House and does the movie got any awards?\",\n",
    "    \"Can you recommend some Top Genres Movies which has more Awards\"\n",
    "]\n",
    "\n",
    "for q in example_queries:\n",
    "    print(f\"\\nQuestion: '{q}'\")\n",
    "    extract_entites_using_cypher_model(graph_db, q)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movie_id</th>\n",
       "      <th>title</th>\n",
       "      <th>languages</th>\n",
       "      <th>awards</th>\n",
       "      <th>imdb_rating</th>\n",
       "      <th>directors</th>\n",
       "      <th>cast</th>\n",
       "      <th>genres</th>\n",
       "      <th>tagline</th>\n",
       "      <th>tagline_embedding</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>221</th>\n",
       "      <td>211</td>\n",
       "      <td>Raiders of the Lost Ark</td>\n",
       "      <td>English | German | Hebrew | Spanish | Arabic |...</td>\n",
       "      <td>32</td>\n",
       "      <td>8.6</td>\n",
       "      <td>Steven Spielberg</td>\n",
       "      <td>Harrison Ford | Karen Allen | Paul Freeman | R...</td>\n",
       "      <td>Action | Adventure</td>\n",
       "      <td>The movie 'Raiders of the Lost Ark' is a ('Act...</td>\n",
       "      <td>[-0.04223256930708885, 0.12403502315282822, -0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>25</td>\n",
       "      <td>Road House</td>\n",
       "      <td>English</td>\n",
       "      <td>0</td>\n",
       "      <td>7.3</td>\n",
       "      <td>Jean Negulesco</td>\n",
       "      <td>Ida Lupino | Cornel Wilde | Celeste Holm | Ric...</td>\n",
       "      <td>Action | Drama | Film-Noir</td>\n",
       "      <td>The movie 'Road House' is a ('Action', 'Drama'...</td>\n",
       "      <td>[-0.04625450447201729, -0.10949589312076569, 0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1076</th>\n",
       "      <td>1036</td>\n",
       "      <td>The Recruit</td>\n",
       "      <td>English | Persian | Russian</td>\n",
       "      <td>0</td>\n",
       "      <td>6.6</td>\n",
       "      <td>Roger Donaldson</td>\n",
       "      <td>Al Pacino | Colin Farrell | Bridget Moynahan |...</td>\n",
       "      <td>Action | Crime | Drama</td>\n",
       "      <td>The movie 'The Recruit' is a ('Action', 'Crime...</td>\n",
       "      <td>[-0.13712893426418304, -0.13582655787467957, -...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>625</th>\n",
       "      <td>605</td>\n",
       "      <td>The Blade</td>\n",
       "      <td>Cantonese</td>\n",
       "      <td>1</td>\n",
       "      <td>7.2</td>\n",
       "      <td>Hark Tsui</td>\n",
       "      <td>Wenzhuo Zhao | Xin Xin Xiong | Sonny Song | Va...</td>\n",
       "      <td>Drama | Action</td>\n",
       "      <td>The movie 'The Blade' is a ('Drama', 'Action')...</td>\n",
       "      <td>[-0.10137008130550385, -0.14402838051319122, -...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1310</th>\n",
       "      <td>1258</td>\n",
       "      <td>72 Meters</td>\n",
       "      <td>Russian | Ukrainian</td>\n",
       "      <td>0</td>\n",
       "      <td>6.7</td>\n",
       "      <td>Vladimir Khotinenko</td>\n",
       "      <td>Sergey Makovetskiy | Marat Basharov | Andrey K...</td>\n",
       "      <td>Drama | Action | Thriller</td>\n",
       "      <td>The movie '72 Meters' is a ('Drama', 'Action',...</td>\n",
       "      <td>[0.03624854236841202, 0.06997304409742355, -0....</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      movie_id                    title  \\\n",
       "221        211  Raiders of the Lost Ark   \n",
       "25          25               Road House   \n",
       "1076      1036              The Recruit   \n",
       "625        605                The Blade   \n",
       "1310      1258                72 Meters   \n",
       "\n",
       "                                              languages  awards  imdb_rating  \\\n",
       "221   English | German | Hebrew | Spanish | Arabic |...      32          8.6   \n",
       "25                                              English       0          7.3   \n",
       "1076                        English | Persian | Russian       0          6.6   \n",
       "625                                           Cantonese       1          7.2   \n",
       "1310                                Russian | Ukrainian       0          6.7   \n",
       "\n",
       "                directors                                               cast  \\\n",
       "221      Steven Spielberg  Harrison Ford | Karen Allen | Paul Freeman | R...   \n",
       "25         Jean Negulesco  Ida Lupino | Cornel Wilde | Celeste Holm | Ric...   \n",
       "1076      Roger Donaldson  Al Pacino | Colin Farrell | Bridget Moynahan |...   \n",
       "625             Hark Tsui  Wenzhuo Zhao | Xin Xin Xiong | Sonny Song | Va...   \n",
       "1310  Vladimir Khotinenko  Sergey Makovetskiy | Marat Basharov | Andrey K...   \n",
       "\n",
       "                          genres  \\\n",
       "221           Action | Adventure   \n",
       "25    Action | Drama | Film-Noir   \n",
       "1076      Action | Crime | Drama   \n",
       "625               Drama | Action   \n",
       "1310   Drama | Action | Thriller   \n",
       "\n",
       "                                                tagline  \\\n",
       "221   The movie 'Raiders of the Lost Ark' is a ('Act...   \n",
       "25    The movie 'Road House' is a ('Action', 'Drama'...   \n",
       "1076  The movie 'The Recruit' is a ('Action', 'Crime...   \n",
       "625   The movie 'The Blade' is a ('Drama', 'Action')...   \n",
       "1310  The movie '72 Meters' is a ('Drama', 'Action',...   \n",
       "\n",
       "                                      tagline_embedding  \n",
       "221   [-0.04223256930708885, 0.12403502315282822, -0...  \n",
       "25    [-0.04625450447201729, -0.10949589312076569, 0...  \n",
       "1076  [-0.13712893426418304, -0.13582655787467957, -...  \n",
       "625   [-0.10137008130550385, -0.14402838051319122, -...  \n",
       "1310  [0.03624854236841202, 0.06997304409742355, -0....  "
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Model Generated Cypher Query:\n",
      "\n",
      "MATCH (m:Movie)-[:WAS_RELEASED_IN]->(l:Language)\n",
      "WHERE l.name = 'English' AND m.awards > 0 \n",
      "RETURN m.title\n",
      "LIMIT 3\n",
      "\n",
      "\n",
      "Fetched Results:\n",
      "[{'m.title': 'Alive'}, {'m.title': 'Kill Me Again'}, {'m.title': 'Predator 2'}]\n",
      "\n",
      "Improved responses:\n",
      "Here are three movies that meet your criteria:\n",
      "\n",
      "1. **Alive** (1991) - Won: 1 award\n",
      "2. **Kill Me Again** (1989) - Nominated for: 1 award\n",
      "3. **Predator 2** (1990) - Won: 4 awards\n",
      "MATCH (m:Movie)-[:WAS_RELEASED_IN]->(l:Language)\n",
      "WHERE l.name = 'English' AND m.awards > 0 \n",
      "RETURN m.title\n",
      "LIMIT 3\n"
     ]
    }
   ],
   "source": [
    "print(extract_entites_using_cypher_model(graph_db, \"recommend 3 movies with  atleast a awards and should be in english language\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Movie {title: STRING, awards: INTEGER, id: STRING, tagline: STRING, imdbRating: FLOAT}\n",
      "Person {name: STRING}\n",
      "Genre {name: STRING}\n",
      "Language {name: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Movie)-[:IN_GENRE]->(:Genre)\n",
      "(:Movie)-[:WAS_RELEASED_IN]->(:Language)\n",
      "(:Person)-[:ACTED_IN]->(:Movie)\n",
      "(:Person)-[:DIRECTED]->(:Movie)\n"
     ]
    }
   ],
   "source": [
    "print(graph_db.schema)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'m.title': 'Alive'}]"
      ]
     },
     "execution_count": 90,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_db.query(\n",
    "\"\"\"\n",
    "\n",
    "MATCH (m:Movie)-[:WAS_RELEASED_IN]->(l:Language)\n",
    "WHERE l.name = 'English' AND m.awards > 1 and m.imdbRating >= 7.0\n",
    "RETURN m.title\n",
    "LIMIT 3\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'m.title': 'Raiders of the Lost Ark'},\n",
       " {'m.title': 'Road House'},\n",
       " {'m.title': 'The Blade'}]"
      ]
     },
     "execution_count": 85,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_db.query(\n",
    "\"\"\"\n",
    "\n",
    "MATCH (m:Movie)\n",
    "WHERE m.imdbRating > 7\n",
    "RETURN m.title\n",
    "LIMIT 3\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movie_id</th>\n",
       "      <th>title</th>\n",
       "      <th>languages</th>\n",
       "      <th>awards</th>\n",
       "      <th>imdb_rating</th>\n",
       "      <th>directors</th>\n",
       "      <th>cast</th>\n",
       "      <th>genres</th>\n",
       "      <th>tagline</th>\n",
       "      <th>tagline_embedding</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>221</th>\n",
       "      <td>211</td>\n",
       "      <td>Raiders of the Lost Ark</td>\n",
       "      <td>English | German | Hebrew | Spanish | Arabic |...</td>\n",
       "      <td>32</td>\n",
       "      <td>8.6</td>\n",
       "      <td>Steven Spielberg</td>\n",
       "      <td>Harrison Ford | Karen Allen | Paul Freeman | R...</td>\n",
       "      <td>Action | Adventure</td>\n",
       "      <td>The movie 'Raiders of the Lost Ark' is a ('Act...</td>\n",
       "      <td>[-0.04223256930708885, 0.12403502315282822, -0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>25</td>\n",
       "      <td>Road House</td>\n",
       "      <td>English</td>\n",
       "      <td>0</td>\n",
       "      <td>7.3</td>\n",
       "      <td>Jean Negulesco</td>\n",
       "      <td>Ida Lupino | Cornel Wilde | Celeste Holm | Ric...</td>\n",
       "      <td>Action | Drama | Film-Noir</td>\n",
       "      <td>The movie 'Road House' is a ('Action', 'Drama'...</td>\n",
       "      <td>[-0.04625450447201729, -0.10949589312076569, 0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1076</th>\n",
       "      <td>1036</td>\n",
       "      <td>The Recruit</td>\n",
       "      <td>English | Persian | Russian</td>\n",
       "      <td>0</td>\n",
       "      <td>6.6</td>\n",
       "      <td>Roger Donaldson</td>\n",
       "      <td>Al Pacino | Colin Farrell | Bridget Moynahan |...</td>\n",
       "      <td>Action | Crime | Drama</td>\n",
       "      <td>The movie 'The Recruit' is a ('Action', 'Crime...</td>\n",
       "      <td>[-0.13712893426418304, -0.13582655787467957, -...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>625</th>\n",
       "      <td>605</td>\n",
       "      <td>The Blade</td>\n",
       "      <td>Cantonese</td>\n",
       "      <td>1</td>\n",
       "      <td>7.2</td>\n",
       "      <td>Hark Tsui</td>\n",
       "      <td>Wenzhuo Zhao | Xin Xin Xiong | Sonny Song | Va...</td>\n",
       "      <td>Drama | Action</td>\n",
       "      <td>The movie 'The Blade' is a ('Drama', 'Action')...</td>\n",
       "      <td>[-0.10137008130550385, -0.14402838051319122, -...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1310</th>\n",
       "      <td>1258</td>\n",
       "      <td>72 Meters</td>\n",
       "      <td>Russian | Ukrainian</td>\n",
       "      <td>0</td>\n",
       "      <td>6.7</td>\n",
       "      <td>Vladimir Khotinenko</td>\n",
       "      <td>Sergey Makovetskiy | Marat Basharov | Andrey K...</td>\n",
       "      <td>Drama | Action | Thriller</td>\n",
       "      <td>The movie '72 Meters' is a ('Drama', 'Action',...</td>\n",
       "      <td>[0.03624854236841202, 0.06997304409742355, -0....</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1375</th>\n",
       "      <td>1322</td>\n",
       "      <td>Harsh Times</td>\n",
       "      <td>English | Spanish | Korean</td>\n",
       "      <td>0</td>\n",
       "      <td>7.0</td>\n",
       "      <td>David Ayer</td>\n",
       "      <td>Christian Bale | Freddy Rodrèguez | Eva Longor...</td>\n",
       "      <td>Action | Crime | Drama</td>\n",
       "      <td>The movie 'Harsh Times' is a ('Action', 'Crime...</td>\n",
       "      <td>[-0.157694011926651, -0.03438868373632431, -0....</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>747</th>\n",
       "      <td>722</td>\n",
       "      <td>Pardes</td>\n",
       "      <td>Hindi</td>\n",
       "      <td>3</td>\n",
       "      <td>7.0</td>\n",
       "      <td>Subhash Ghai</td>\n",
       "      <td>Shah Rukh Khan | Amrish Puri | Mahima Chaudhry...</td>\n",
       "      <td>Musical | Romance | Action</td>\n",
       "      <td>The movie 'Pardes' is a ('Musical', 'Romance',...</td>\n",
       "      <td>[0.013346046209335327, 0.044293999671936035, -...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>530</th>\n",
       "      <td>513</td>\n",
       "      <td>Alive</td>\n",
       "      <td>English</td>\n",
       "      <td>2</td>\n",
       "      <td>7.0</td>\n",
       "      <td>Frank Marshall</td>\n",
       "      <td>Ethan Hawke | Vincent Spano | Josh Hamilton | ...</td>\n",
       "      <td>Action | Adventure | Biography</td>\n",
       "      <td>The movie 'Alive' is a ('Action', 'Adventure',...</td>\n",
       "      <td>[-0.14148733019828796, 0.00758203212171793, -0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>966</th>\n",
       "      <td>928</td>\n",
       "      <td>Proof of Life</td>\n",
       "      <td>English | Spanish | Russian | Italian | French</td>\n",
       "      <td>0</td>\n",
       "      <td>6.2</td>\n",
       "      <td>Taylor Hackford</td>\n",
       "      <td>Meg Ryan | Russell Crowe | David Morse | Pamel...</td>\n",
       "      <td>Action | Drama | Thriller</td>\n",
       "      <td>The movie 'Proof of Life' is a ('Action', 'Dra...</td>\n",
       "      <td>[-0.08460134267807007, 0.02772543579339981, 0....</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1171</th>\n",
       "      <td>1129</td>\n",
       "      <td>Kopps</td>\n",
       "      <td>Swedish | English</td>\n",
       "      <td>5</td>\n",
       "      <td>6.8</td>\n",
       "      <td>Josef Fares</td>\n",
       "      <td>Fares Fares | Torkel Petersson | Gèran Ragners...</td>\n",
       "      <td>Action | Comedy</td>\n",
       "      <td>The movie 'Kopps' is a ('Action', 'Comedy') fi...</td>\n",
       "      <td>[-0.05063479766249657, 0.05785154923796654, -0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>312</th>\n",
       "      <td>300</td>\n",
       "      <td>8 Million Ways to Die</td>\n",
       "      <td>English | Spanish</td>\n",
       "      <td>1</td>\n",
       "      <td>5.6</td>\n",
       "      <td>Hal Ashby</td>\n",
       "      <td>Jeff Bridges | Rosanna Arquette | Alexandra Pa...</td>\n",
       "      <td>Action | Adventure | Crime</td>\n",
       "      <td>The movie '8 Million Ways to Die' is a ('Actio...</td>\n",
       "      <td>[-0.02991602197289467, -0.12178963422775269, -...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>509</th>\n",
       "      <td>493</td>\n",
       "      <td>Freejack</td>\n",
       "      <td>English</td>\n",
       "      <td>0</td>\n",
       "      <td>5.3</td>\n",
       "      <td>Geoff Murphy</td>\n",
       "      <td>Emilio Estevez | Mick Jagger | Rene Russo | An...</td>\n",
       "      <td>Action | Crime | Sci-Fi</td>\n",
       "      <td>The movie 'Freejack' is a ('Action', 'Crime', ...</td>\n",
       "      <td>[-0.10398722440004349, 0.022921709343791008, -...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>985</th>\n",
       "      <td>947</td>\n",
       "      <td>American Outlaws</td>\n",
       "      <td>English</td>\n",
       "      <td>0</td>\n",
       "      <td>6.0</td>\n",
       "      <td>Les Mayfield</td>\n",
       "      <td>Colin Farrell | Scott Caan | Ali Larter | Gabr...</td>\n",
       "      <td>Action | Western</td>\n",
       "      <td>The movie 'American Outlaws' is a ('Action', '...</td>\n",
       "      <td>[-0.05143808200955391, -0.10734419524669647, -...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1296</th>\n",
       "      <td>1245</td>\n",
       "      <td>River Queen</td>\n",
       "      <td>English | Maori</td>\n",
       "      <td>3</td>\n",
       "      <td>6.0</td>\n",
       "      <td>Vincent Ward</td>\n",
       "      <td>Samantha Morton | Kiefer Sutherland | Cliff Cu...</td>\n",
       "      <td>Action | Adventure | Drama</td>\n",
       "      <td>The movie 'River Queen' is a ('Action', 'Adven...</td>\n",
       "      <td>[0.06851008534431458, -0.11972963809967041, -0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>417</th>\n",
       "      <td>402</td>\n",
       "      <td>Kill Me Again</td>\n",
       "      <td>English</td>\n",
       "      <td>1</td>\n",
       "      <td>6.3</td>\n",
       "      <td>John Dahl</td>\n",
       "      <td>Pat Mulligan | Nick Dimitri | Michael Madsen |...</td>\n",
       "      <td>Action | Crime | Drama</td>\n",
       "      <td>The movie 'Kill Me Again' is a ('Action', 'Cri...</td>\n",
       "      <td>[-0.12356139719486237, -0.1932821273803711, -0...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      movie_id                    title  \\\n",
       "221        211  Raiders of the Lost Ark   \n",
       "25          25               Road House   \n",
       "1076      1036              The Recruit   \n",
       "625        605                The Blade   \n",
       "1310      1258                72 Meters   \n",
       "1375      1322              Harsh Times   \n",
       "747        722                   Pardes   \n",
       "530        513                    Alive   \n",
       "966        928            Proof of Life   \n",
       "1171      1129                    Kopps   \n",
       "312        300    8 Million Ways to Die   \n",
       "509        493                 Freejack   \n",
       "985        947         American Outlaws   \n",
       "1296      1245              River Queen   \n",
       "417        402            Kill Me Again   \n",
       "\n",
       "                                              languages  awards  imdb_rating  \\\n",
       "221   English | German | Hebrew | Spanish | Arabic |...      32          8.6   \n",
       "25                                              English       0          7.3   \n",
       "1076                        English | Persian | Russian       0          6.6   \n",
       "625                                           Cantonese       1          7.2   \n",
       "1310                                Russian | Ukrainian       0          6.7   \n",
       "1375                         English | Spanish | Korean       0          7.0   \n",
       "747                                               Hindi       3          7.0   \n",
       "530                                             English       2          7.0   \n",
       "966      English | Spanish | Russian | Italian | French       0          6.2   \n",
       "1171                                  Swedish | English       5          6.8   \n",
       "312                                   English | Spanish       1          5.6   \n",
       "509                                             English       0          5.3   \n",
       "985                                             English       0          6.0   \n",
       "1296                                    English | Maori       3          6.0   \n",
       "417                                             English       1          6.3   \n",
       "\n",
       "                directors                                               cast  \\\n",
       "221      Steven Spielberg  Harrison Ford | Karen Allen | Paul Freeman | R...   \n",
       "25         Jean Negulesco  Ida Lupino | Cornel Wilde | Celeste Holm | Ric...   \n",
       "1076      Roger Donaldson  Al Pacino | Colin Farrell | Bridget Moynahan |...   \n",
       "625             Hark Tsui  Wenzhuo Zhao | Xin Xin Xiong | Sonny Song | Va...   \n",
       "1310  Vladimir Khotinenko  Sergey Makovetskiy | Marat Basharov | Andrey K...   \n",
       "1375           David Ayer  Christian Bale | Freddy Rodrèguez | Eva Longor...   \n",
       "747          Subhash Ghai  Shah Rukh Khan | Amrish Puri | Mahima Chaudhry...   \n",
       "530        Frank Marshall  Ethan Hawke | Vincent Spano | Josh Hamilton | ...   \n",
       "966       Taylor Hackford  Meg Ryan | Russell Crowe | David Morse | Pamel...   \n",
       "1171          Josef Fares  Fares Fares | Torkel Petersson | Gèran Ragners...   \n",
       "312             Hal Ashby  Jeff Bridges | Rosanna Arquette | Alexandra Pa...   \n",
       "509          Geoff Murphy  Emilio Estevez | Mick Jagger | Rene Russo | An...   \n",
       "985          Les Mayfield  Colin Farrell | Scott Caan | Ali Larter | Gabr...   \n",
       "1296         Vincent Ward  Samantha Morton | Kiefer Sutherland | Cliff Cu...   \n",
       "417             John Dahl  Pat Mulligan | Nick Dimitri | Michael Madsen |...   \n",
       "\n",
       "                              genres  \\\n",
       "221               Action | Adventure   \n",
       "25        Action | Drama | Film-Noir   \n",
       "1076          Action | Crime | Drama   \n",
       "625                   Drama | Action   \n",
       "1310       Drama | Action | Thriller   \n",
       "1375          Action | Crime | Drama   \n",
       "747       Musical | Romance | Action   \n",
       "530   Action | Adventure | Biography   \n",
       "966        Action | Drama | Thriller   \n",
       "1171                 Action | Comedy   \n",
       "312       Action | Adventure | Crime   \n",
       "509          Action | Crime | Sci-Fi   \n",
       "985                 Action | Western   \n",
       "1296      Action | Adventure | Drama   \n",
       "417           Action | Crime | Drama   \n",
       "\n",
       "                                                tagline  \\\n",
       "221   The movie 'Raiders of the Lost Ark' is a ('Act...   \n",
       "25    The movie 'Road House' is a ('Action', 'Drama'...   \n",
       "1076  The movie 'The Recruit' is a ('Action', 'Crime...   \n",
       "625   The movie 'The Blade' is a ('Drama', 'Action')...   \n",
       "1310  The movie '72 Meters' is a ('Drama', 'Action',...   \n",
       "1375  The movie 'Harsh Times' is a ('Action', 'Crime...   \n",
       "747   The movie 'Pardes' is a ('Musical', 'Romance',...   \n",
       "530   The movie 'Alive' is a ('Action', 'Adventure',...   \n",
       "966   The movie 'Proof of Life' is a ('Action', 'Dra...   \n",
       "1171  The movie 'Kopps' is a ('Action', 'Comedy') fi...   \n",
       "312   The movie '8 Million Ways to Die' is a ('Actio...   \n",
       "509   The movie 'Freejack' is a ('Action', 'Crime', ...   \n",
       "985   The movie 'American Outlaws' is a ('Action', '...   \n",
       "1296  The movie 'River Queen' is a ('Action', 'Adven...   \n",
       "417   The movie 'Kill Me Again' is a ('Action', 'Cri...   \n",
       "\n",
       "                                      tagline_embedding  \n",
       "221   [-0.04223256930708885, 0.12403502315282822, -0...  \n",
       "25    [-0.04625450447201729, -0.10949589312076569, 0...  \n",
       "1076  [-0.13712893426418304, -0.13582655787467957, -...  \n",
       "625   [-0.10137008130550385, -0.14402838051319122, -...  \n",
       "1310  [0.03624854236841202, 0.06997304409742355, -0....  \n",
       "1375  [-0.157694011926651, -0.03438868373632431, -0....  \n",
       "747   [0.013346046209335327, 0.044293999671936035, -...  \n",
       "530   [-0.14148733019828796, 0.00758203212171793, -0...  \n",
       "966   [-0.08460134267807007, 0.02772543579339981, 0....  \n",
       "1171  [-0.05063479766249657, 0.05785154923796654, -0...  \n",
       "312   [-0.02991602197289467, -0.12178963422775269, -...  \n",
       "509   [-0.10398722440004349, 0.022921709343791008, -...  \n",
       "985   [-0.05143808200955391, -0.10734419524669647, -...  \n",
       "1296  [0.06851008534431458, -0.11972963809967041, -0...  \n",
       "417   [-0.12356139719486237, -0.1932821273803711, -0...  "
      ]
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.head(15)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
